data/input/naca2412/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.00375;
        value           uniform 0.00375;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 0.00375;
        value           uniform 0.00375;
    }

    top
    {
        type            freestream;
        freestreamValue uniform 0.00375;
        value           uniform 0.00375;
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform 0.00375;
        value           uniform 0.00375;
    }

    airfoil
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }

    frontAndBack
    {
        type            empty;
    }
}
