data/input/naca2412/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 10;
        value           uniform 10;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 10;
        value           uniform 10;
    }

    top
    {
        type            freestream;
        freestreamValue uniform 10;
        value           uniform 10;
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform 10;
        value           uniform 10;
    }

    airfoil
    {
        type            omegaWallFunction;
        value           uniform 10;
    }

    frontAndBack
    {
        type            empty;
    }
}
