data/input/naca2412/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-5  -5   0)     // 0
    (15  -5   0)     // 1
    (15   5   0)     // 2
    (-5   5   0)     // 3
    (-5  -5   0.1)   // 4
    (15  -5   0.1)   // 5
    (15   5   0.1)   // 6
    (-5   5   0.1)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    top
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);
